cypress/fixtures/convenios/procesarPago.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sn="http://www.bncr.fi.cr/soa/SN_PagoConvenios_V2.0" xmlns:esq="http://www.bncr.fi.cr/soa/EsquemasComunes">
   <soapenv:Header/>
   <soapenv:Body>
      <sn:solicitud>
         <!--Optional:-->
         <sn:encabezado>
            <sn:fechaHoraConsumo>2020-01-26T19:15:54.294Z</sn:fechaHoraConsumo>
            <sn:canalConsumidor>IBP</sn:canalConsumidor>
            <sn:usuarioConsumidor>113720104</sn:usuarioConsumidor>
            <sn:direccionIPConsumo>?</sn:direccionIPConsumo>
            <sn:nombreServicio>?</sn:nombreServicio>
         </sn:encabezado>
         <!--Optional:-->
         <sn:cuerpo>
            <!--Optional:-->
            <sn:entradaServicio>
               <sn:pagos>
                  <!--Zero or more repetitions:-->
                  <sn:pago>
                     <!--Optional:-->
                     <sn:transaccion>PAGO_SERVICIOS</sn:transaccion>
                     <!--Optional:-->
                     <sn:subTransaccion>1</sn:subTransaccion>
                     <!--Optional:-->
                     <sn:sistemaConvenios>ConvenioPagoServios</sn:sistemaConvenios>
                     <!--Optional:-->
                     <sn:formaPago>1</sn:formaPago>
                     <!--Optional:-->
                     <sn:tipoConectividad>2</sn:tipoConectividad>
                     <!--Optional:-->
                     <sn:codigoConvenio>1</sn:codigoConvenio>
                     <!--Optional:-->
                     <sn:tipoLlave>99</sn:tipoLlave>
                     <!--Optional:-->
                     <sn:empresa>156</sn:empresa>
                     <!--Optional:-->
                     <sn:numeroServicio>113720104</sn:numeroServicio>
                     <!--Optional:-->
                     <sn:codigoInstitucion>156</sn:codigoInstitucion>
                     <!--Optional:-->
                     <sn:usuarioTC>IBANK</sn:usuarioTC>
                     <!--Optional:-->
                     <sn:codigoBanco>151</sn:codigoBanco>
                     <!--Optional:-->
                     <sn:codigoAgencia>228</sn:codigoAgencia>
                     <!--Optional:-->
                     <sn:tipoCanal>6</sn:tipoCanal>
                     <!--Optional:-->
                     <sn:tipoTransaccionPago>1</sn:tipoTransaccionPago>
                     <!--Optional:-->
                     <sn:valorServicio>113720104</sn:valorServicio>
                     <!--Optional:-->
                     <sn:periodoRecibo>20220302</sn:periodoRecibo>
                     <!--Optional:-->
                     <sn:montoRecibo>2000.00</sn:montoRecibo>
                     <!--Optional:-->
                     <sn:fechaVencimiento></sn:fechaVencimiento>
                     <!--Optional:-->
                     <sn:numeroFactura>00000000000002893354</sn:numeroFactura>
                     <!--Optional:-->
                     <sn:selfDeVerificacion>0</sn:selfDeVerificacion>
                     <!--Optional:-->
                     <sn:numeroCuotas>0</sn:numeroCuotas>
                     <!--Optional:-->
                     <sn:monedaServicio>01</sn:monedaServicio>
                     <!--Optional:-->
                     <sn:nombreEmpresa>ICER - MEP</sn:nombreEmpresa>
                     <!--Optional:-->
                     <sn:nombreConvenio>PRUEBAS ICER</sn:nombreConvenio>
                     <!--Optional:-->
                     <sn:nombreValorServicio>IDENTIFICACION</sn:nombreValorServicio>
                     <!--Optional:-->
                     <sn:nombreDuenoRecibo>CARLOS LUIS RUIZ CAMPOS</sn:nombreDuenoRecibo>
                     <!--Optional:-->
                     <sn:numeroTransaccion>0</sn:numeroTransaccion>
                     <!--Optional:-->
                     <sn:numeroValoresPago>1</sn:numeroValoresPago>
                     <!--Optional:-->
                     <sn:tipoValorPago>6</sn:tipoValorPago>
                     <!--Optional:-->
                     <sn:codigoBancoEmisor>0</sn:codigoBancoEmisor>
                     <!--Optional:-->
                     <sn:numeroChequeDelValor></sn:numeroChequeDelValor>
                     <!--Optional:-->
                     <sn:numeroCuentaCorrienteValor></sn:numeroCuentaCorrienteValor>
                     <!--Optional:-->
                     <sn:oficina>228</sn:oficina>
                     <!--Optional:-->
                     <sn:montoMovimiento>2000.00</sn:montoMovimiento>
                     <!--Optional:-->
                     <sn:monedaTransaccion>01</sn:monedaTransaccion>
                     <!--Optional:-->
                     <sn:tipoIdentificacion>1</sn:tipoIdentificacion>
                     <!--Optional:-->
                     <sn:numeroIdentificacion>6-0383-0569</sn:numeroIdentificacion>
                     <!--Optional:-->
                     <sn:numeroCliente>695517</sn:numeroCliente>
                     <!--Optional:-->
                     <sn:cuentaClienteOrigen></sn:cuentaClienteOrigen>
                     <!--Optional:-->
                     <sn:productoOrigen>100</sn:productoOrigen>
                     <!--Optional:-->
                     <sn:monedaOrigen>01</sn:monedaOrigen>
                     <!--Optional:-->
                     <sn:oficinaOrigen>000</sn:oficinaOrigen>
                     <!--Optional:-->
                     <sn:numeroCuentaOrigen>325970</sn:numeroCuentaOrigen>
                     <!--Optional:-->
                     <sn:digitoVerificadorOrigen>9</sn:digitoVerificadorOrigen>
                     <!--Optional:-->
                     <sn:detalleMovimiento>Pago I.C.E.R 113720104</sn:detalleMovimiento>
                     <!--Optional:-->
                     <sn:nombreDepositante>ARCE HERNANDEZ JEYCO MAQUEY</sn:nombreDepositante>
                     <!--Optional:-->
                     <sn:motivoCompraVenta>00</sn:motivoCompraVenta>
                     <!--Optional:-->
                     <sn:tarjeta></sn:tarjeta>
                     <!--Optional:-->
                     <sn:fechaVence></sn:fechaVence>
                     <!--Optional:-->
                     <sn:codigoEstablecimiento></sn:codigoEstablecimiento>
                     <!--Optional:-->
                     <sn:origenProceso></sn:origenProceso>
                     <sn:cuentaIBANOrigen>CR92 0151 0001 0013 2597 09</sn:cuentaIBANOrigen>
                     <sn:esFavorito>true</sn:esFavorito>
                  </sn:pago>
               </sn:pagos>
            </sn:entradaServicio>
         </sn:cuerpo>
      </sn:solicitud>
   </soapenv:Body>
</soapenv:Envelope>